#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# 简介:
# 面向对象：python中，一切皆对象
'''
面向过程：
在程序中：
	1》代码从上而下顺序执行
	2》每一模块内部均是由顺序、选择和循环三种基本结构组成
	3》程序流程在写程序时就已决定

面向对象
在程序中：
	把数据及对数据的操作方法放在一起，作为一个相互依存的整体——对象
	1》对同类对象抽象出其共性，形成类
	2》类中的大多数数据，只能用本类的方法进行处理
	3》程序流程由用户在使用中决定
	4》使用面向对象进行开发，先要去找具有所需功能的对象，如果该对象不存在，那么创建一个具有该功能的对象
注意：面向对象只是一种思想，并不是一门编程语言,也不会绑定编程语言


面向过程和面向对象的优缺点【面试题】
面向过程：
	优点：性能比面向对象高，比如单片机、嵌入式开发等一般采用面向过程开发，因为性能是最重要的因素
	缺点：没有面向对象易维护，易复用，易扩展，开销比较大，比较消耗资源

面向对象：
	优点：易维护，易复用，易扩展，由于面向对象有封装，继承，多态的特性，可以设计出低耦合的系统，使得系统更加灵活，更加易于维护
	缺点：性能比面向过程低


吃狗屎：面向过程
狗吃屎：面向对象
使用面向对象的思维解决问题，核心：类和对象

'''