# lxml、xml、XPath 简介

# 1. lxml
'''
    lxml 是python语言中用于处理xml 和html 的功能最丰富最完善最简单的模块
    利用xpth 就可以实现xml 或者html 中解析数据
'''
# 2.xml
'''
    xml 可拓展标记语言，xml 是一种很像html 的标记语言，但是xml 和html 属于两个领域的内容
    html 用于从网页显示数据，xml 用于在网络中传输和存储数据
'''

# 3.XPath
'''
    XPath 是一种在xml 和HTML 文档中查找信息的语言。 XPath使用路径表达式 
    在xml 和html 文档中进行导航。XPath使用路径表达式 和
    我们常用的相对路径和绝对路径很相似
'''
# 4. XPath的语法结构
'''
    XPath 中需要理解的概念：树、节点、根节点、元素节点、属性节点
    注释节点、文本节点
    1.树：指整个html或者XML。
    2.节点：树结构中的每个部分（标签、文本、属性、注释等）就是一个节点。
    
    3.根节点：树结构中第一个节点（最外层的标签）就是根节点
    4.元素节点：一个标签整体就是一个元素节点，例如：<name>沃尔玛</name>
    5.属性节点：标签内的一个属性就是一个属性节点，例如：age=“20”
    6.注释节点：一个注释就是一个注释节点，例如：<!--  这是一条平平无奇的注释  -->
    7.文本节点：标签内的文字就是一个文本节点。
'''

